function getTips(){
	return [
	{
		"keywords":"ワープ探知",
		"eng":"Warp Detection",
		"tips":"滞在惑星に対して敵の攻撃ウェーブがワープしようとしている際、それを探知する。<br>これらの機能を持つ艦が存在しない惑星へと攻撃の予告が行われた場合、予告の対象惑星名が？になる。"
	},
	{
		"keywords":"先進ワープ探知",
		"eng":"Advanced Warp Detection",
		"tips":"滞在惑星に対して敵の攻撃ウェーブがワープしようとしている際、それを探知し、さらに敵が侵入してくるワームホールが変色して位置を知らせる。<br>これらの機能を持つ艦が存在しない惑星へと攻撃の予告が行われた場合、予告の対象惑星名が？になる。"
	},
	{
		"keywords":"クローク機能",
		"eng":"Cloaking",
		"tips":"自動的に姿を隠し、敵から基本的に探知されなくなる。<br>攻撃後およびタキオンビームを受けてから一定時間はクロークが強制解除される。"
	},
	{
		"keywords":"テレポート機能",
		"eng":"Teleports",
		"tips":"移動時、テレポート機能を持たない艦とグループ移動を行っている場合でない限り、目的地に瞬間移動する。他の惑星への直接移動は不可能だが、同惑星内であればどこにでも移動可能。<br>移動後、テレポートの反動により動いた距離に応じて短時間の麻痺を受ける。"
	},
	{
		"keywords":"製造支援",
		"eng":"Construction Rate x",
		"tips":"工場における兵器生産および基地設備などの設置を支援する。数値は工場などの基本生産速度を1とした際の相対的な作業速度。"
	},
	{
		"keywords":"修理機能",
		"eng":"Repair Rate x",
		"tips":"味方艦を修理し、耐久度とエンジン耐久を回復する。耐久度の修理には資源を消費。<br>数値は修理速度を示す。高いほどより高速。<br>攻撃を受けたばかりの艦は修理の対象にできない。修理中だった場合も中断される。<br>一部の艦は複数をまとめて修理可能。"
	},
	{
		"keywords":"敵の探知不可",
		"eng":"Blind",
		"tips":"これらの艦しか居ない惑星では敵を視認することができず、味方が居ない場合と同じように霧がかかったままになる。"
	},
	{
		"keywords":"自己修復",
		"eng":"Regen Time xx:xx",
		"tips":"なにもしなくても自動的に耐久度を回復する。通常の修理と同じく、敵の攻撃を受けてから数秒間は回復が停止する。<br>表記されている時間は、耐久度1から最大値まで回復するのにかかる時間。<br>一部の艦は味方惑星に居る間のみ機能する（備考欄に明記）。"
	},
	{
		"keywords":"敵惑星では4倍のダメージを受ける",
		"eng":"4X Damage On Enemy Planets",
		"tips":"敵惑星に居る間、受けるダメージがすべて4倍になる。"
	},
	{
		"keywords":"研究",
		"eng":"Knowledge",
		"tips":"滞在する惑星から知識を回収する。各惑星が産出できる知識は最大で3000まで。<br>原則として、敵惑星では研究できない。"
	},
	{
		"keywords":"サプライが必要",
		"eng":"Requires Supply",
		"tips":"味方惑星およびそれに隣接する惑星でのみ活動可能（ただし移動だけは阻害されないので、通過はできる）。<br>一部の艦が持つサプライ遮断効果や、核攻撃などによる惑星破壊により、本来ならサプライが供給されている惑星でも機能できない場合がある。"
	},
	{
		"keywords":"偵察情報収集",
		"eng":"Gathers Scout Intel",
		"tips":"滞在する惑星の軍事情報を自動的に収集し、銀河マップ画面で確認できる情報パネルと、惑星画面の右側で確認できる敵艦の一覧を更新する。"
	},
	{
		"keywords":"エネルギー不足無視",
		"eng":"Unaffected By Negative Energy",
		"tips":"エネルギー供給量が消費量を下回ると、通常はクロークなどを含めた艦の機能の大半が停止するが、この艦はその影響を無視する。"
	},
	{
		"keywords":"味方艦のクローク強化",
		"eng":"Cloaking Booster",
		"tips":"周囲一定範囲内に居る味方クローク艦のクロークを強化し、タキオンビームによる探知を不可能にする。こちらから攻撃した際のクローク停止は防げない。<br>クローク強化を行っている艦自身は、他の艦からの強化を受けることができない。"
	},
	{
		"keywords":"敵のレーダー照準を妨害",
		"eng":"Radar Dampening Range xxxx",
		"tips":"表記されている範囲よりも外に居る敵からは、本来なら射程内であったとしても攻撃の対象とされることがない。<br>標的にならないのは自分のみ。他の味方を保護するような機能はない。"
	},
	{
		"keywords":"防御貫通",
		"eng":"Armor Piercing xxx",
		"tips":"攻撃の際、敵の防御力を数値分だけ無視。防御力を超えるほどの貫通力があったとしても、マイナスになることはない。"
	},
	{
		"keywords":"エンジンダメージ",
		"eng":"Engine Damage xxx",
		"tips":"攻撃と同時に敵のエンジン耐久を削り、移動速度を低下させる。低下する割合は、エンジン耐久の最大値と現在値の差に比例。<br>エンジン耐久が無限（ゲーム内ではInfと表示）の場合、事実上無効となる。"
	},
	{
		"keywords":"トラクタービーム照射",
		"eng":"Xx Tractor Beam",
		"tips":"射程内の敵艦をトラクタービームで規定の数まで捕獲し、移動を禁止する。捕獲した状態で移動した場合、位置関係を保ったままで捕縛した敵艦も移動する。<br>敵を捕縛したままワームホールを移動することも可能。"
	},
	{
		"keywords":"タキオンビーム照射",
		"eng":"Tachyon Beam Emission",
		"tips":"射程に入った敵クローク艦に自動的にタキオンビームを照射し、短時間クロークを強制解除する。同時に照射できる数に制限はないが、クローク強化状態の艦を看破することはできない。"
	},
	{
		"keywords":"惑星全域へタキオンビーム放射",
		"eng":"Planetary Tachyon Beam Coverage",
		"tips":"惑星内の敵クローク艦に自動的にタキオンビームを照射し、短時間クロークを強制解除する。同時に照射できる数に制限はないが、クローク強化状態の艦を看破することはできない。"
	},
	{
		"keywords":"敵艦を鹵獲",
		"eng":"Reclaims Enemy Ships",
		"tips":"敵を攻撃した際に鹵獲ダメージを蓄積させ、その艦が破壊されると同時に完全回復した状態で自分のものにするように試みる。<br>鹵獲を成功させるためには、蓄積した鹵獲ダメージが対象の最大耐久度の半分を超えていなくてはならない。また人間側の場合、鹵獲しようとしている艦をすでに維持上限に達するほど保有していてはならない。<br>与える鹵獲ダメージは、互いのランクの差に基づいて倍率がかかる。鹵獲攻撃を行う艦のランクが高いほど効率的。"
	},
	{
		"keywords":"味方艦の攻撃力増加",
		"eng":"Attack Boost For Allied Ships",
		"tips":"射程内の味方艦の攻撃力を表記された分だけ増加させる。複数の艦からのブーストを同時に受けることはできず、そのうち効果がもっとも大きい１つだけが影響する。<br>一部の艦は受けられるブーストに上限あり。"
	},
	{
		"keywords":"惑星全域の味方艦の攻撃力増加",
		"eng":"Attack Boost For All Allied Ships On Planet",
		"tips":"惑星内の味方艦の攻撃力を表記された分だけ増加させる。複数の艦からのブーストを同時に受けることはできず、そのうち効果がもっとも大きい１つだけが影響する。<br>一部の艦は受けられるブーストに上限あり。"
	},
	{
		"keywords":"味方艦の移動速度増加",
		"eng":"Increases Ally Speed By xx%",
		"tips":"惑星内の味方艦の移動速度を表記された分だけ増加させる。割合ブースト同士は同時に受けることはできず、そのうち効果がもっとも大きい1つだけが影響する<br>ただし定数ブーストとは共存可能で、定数ブーストで加算された分も含めて倍増させる。"
	},
	{
		"keywords":"麻痺攻撃",
		"eng":"Attack Paralyzes xX",
		"tips":"攻撃した敵を麻痺させ、表記された時間だけすべての行動を封じる。"
	},
	{
		"keywords":"資源生産",
		"eng":"Produces",
		"tips":"毎秒、表記されているだけの資源を生産する。エネルギーのみ蓄積はされない。"
	},
	{
		"keywords":"資源消費",
		"eng":"Produces",
		"tips":"毎秒、表記されているだけの資源を消費する。ゲーム中では生産の場合と同じ位置にマイナスで表示。"
	},
	{
		"keywords":"自動攻撃",
		"eng":"Target Seek Range xxx",
		"tips":"とくに命令を受けていない場合、範囲内に敵が入ると自動的に攻撃対象とする。"
	},
	{
		"keywords":"自動消耗",
		"eng":"Self Attrition Time xx:xx",
		"tips":"なにかに格納された状態にない限り、耐久度が自動的に減少する。表記されている時間は、耐久度が最大から0になるまでにかかる時間。"
	},
	{
		"keywords":"Stand-Down中は自動消耗停止",
		"eng":"Self Attrition Only When Not In Stand-Down",
		"tips":"Stand-Downモードに切り替えると、自動消耗による耐久度減少が一時的に停止する。"
	},
	{
		"keywords":"攻撃時に吸収回復",
		"eng":"Vampirism",
		"tips":"攻撃と同時に自己修復を行い、耐久度を回復する。"
	},
	{
		"keywords":"攻撃強化上限",
		"eng":"Personal Attack Boost Limited To +xx%",
		"tips":"攻撃力強化を受けた際、その効果がどれほど強力であったとしても、表記されている割合以上には攻撃力が上がらない。"
	},
	{
		"keywords":"自動後退",
		"eng":"Retreat Range xxxx",
		"tips":"とくに命令を受けていない場合、敵艦が表記された距離以上に接近してきた際に自動的に距離を開けるように移動を試みる。<br>フォースフィールドに保護されている場合、この動作は行われない。"
	},
	{
		"keywords":"攻撃時に自分にもダメージ",
		"eng":"Attacks Are Self-Damaging",
		"tips":"攻撃時、反動により自分自身にもダメージ。受けるダメージは艦により異なり、必ずしも攻撃力と同等ではない。"
	},
	{
		"keywords":"敵艦を破壊時に爆破",
		"eng":"Makes Enemies Explode Violently On Death",
		"tips":"攻撃時に敵の動力源を損傷させ、その艦が破壊されると同時に大爆発を発生させる。最後の一撃をこの艦で行う必要は無い。<br>爆発の威力はこの能力を持つ艦がどの程度ダメージを与えていたかに依存するが、爆発した艦の最大耐久度の10分の1を超えることはない。"
	},
	{
		"keywords":"敵艦を資源に変換",
		"eng":"Converts Enemies To Resources",
		"tips":"攻撃時に敵を分解し、その艦が破壊されると作成に必要な資源の一部を回収する。最後の一撃をこの艦で行う必要は無い。<br>回収できる資源の割合は、この能力を持つ艦がどの程度ダメージを与えていたかに依存する。"
	},
	{
		"keywords":"格納上限",
		"eng":"Transports xx Ships",
		"tips":"内部に格納しておける艦の数。大きさの概念はなく、格納できる艦ならすべてが1つとして計算される。<br>この能力自体は格納の方法を問わず表記されており、通常の輸送艦から敵艦を丸呑みする戦闘艦まで、多様な艦が保有する。"
	},
	{
		"keywords":"重力波放射",
		"eng":"Max Ship Speed xx Within xxxx Range",
		"tips":"範囲内に居る敵艦の移動速度を、規定値まで強制的に低下させる。"
	},
	{
		"keywords":"敵の防御力を攻撃ごとに低下",
		"eng":"Armor Damage xxxx",
		"tips":"攻撃時、敵の防御力を低下させる。これにより低下した防御力は修理では回復せず、最大防御力に応じた速度でゆっくりと自動回復する。"
	},
	{
		"keywords":"一定のビルドポイントごとに自己複製",
		"eng":"Replicates Every xxxxx Build Points",
		"tips":"攻撃時にビルドポイントを蓄積し、それが一定値に達すると自身と同型の艦を新たに1つ作成する。"
	},
	{
		"keywords":"ミサイル攻撃を自分に誘引",
		"eng":"Attracts All Incoming Missiles",
		"tips":"敵のMissile属性の弾を誘引し、別の味方艦を狙っていたものでも自分を狙うように強制する。"
	},
	{
		"keywords":"味方艦の防御力増加",
		"eng":"Armor Boost For Allied Ships",
		"tips":"射程内の味方艦の防御力を3倍に増加させる。複数の艦から同時にブーストを受けることはできない。"
	},
	{
		"keywords":"敵艦の防御力が高いほど攻撃力が増加",
		"eng":"Does More Damage To Heavily Armored Targets",
		"tips":"標的の防御力が高いほど攻撃力が増加。ただし増加は防御力100で上限に達する。"
	},
	{
		"keywords":"射程内から受けた攻撃を撃ち返す",
		"eng":"Reflects Incoming Attacks",
		"tips":"攻撃を受けた際、それが自身の射程内からの攻撃だった場合、受けた弾をそのまま再現して敵に撃ち返す。<br>攻撃に付属する鹵獲などの特殊効果は再現できず、また範囲攻撃、近接攻撃およびMissile属性の弾は撃ち返せない。"
	},
	{
		"keywords":"自身へのあらゆるダメージが増加",
		"eng":"All Attackers Get Damage Bonus Against This xX",
		"tips":"受けた攻撃のダメージがすべて数倍に増加する。"
	},
	{
		"keywords":"EMP吸収",
		"eng":"Absorbs EMPs",
		"tips":"EMP効果を受けた際、耐久度が即座に最大まで回復する。<br>この能力はEMPの通常の効果を無効にしない。"
	},
	{
		"keywords":"周囲の味方への攻撃をすべて自分に誘引",
		"eng":"Attracts All Incoming Shots",
		"tips":"敵の攻撃をすべて誘引し、別の味方艦を狙っていたものでも自分を狙うように強制する。<br>フォースフィールドへの耐性により無効化される。"
	},
	{
		"keywords":"射程内すべてを攻撃",
		"eng":"Strikes All Enemies In Range",
		"tips":"攻撃時、射程内に居る敵すべてにダメージを与える。"
	},
	{
		"keywords":"爆発時惑星全域にEMP効果",
		"eng":"xx Second EMP On Destruction",
		"tips":"破壊された際、惑星全域に影響するEMPパルスを放射。敵味方問わずすべての艦を麻痺させ、クローク、フォースフィールドを無効化する。"
	},
	{
		"keywords":"破壊時に核爆発発生",
		"eng":"Emits XX Nuclear Explosion On Destruction",
		"tips":"破壊された際、規定された範囲の惑星に影響する核爆発を発生させる。<br>影響を受けた惑星に滞在する艦は一撃で破壊され、さらに惑星にあった資源採集ポイントが消滅。またその惑星では永久的にサプライが妨害される（人間とAIの両方に影響）。"
	},
	{
		"keywords":"破壊時にAIプログレス増加",
		"eng":"+XX AI Progress If Killed Or Scrapped",
		"tips":"破壊された際、AIプログレスが一定値増加する。自分で処分した場合も発動。"
	},
	{
		"keywords":"鹵獲前に破壊するとAIプログレス増加",
		"eng":"+XX AI Progress if Killed (AI Only)",
		"tips":"AIが保有している際、攻撃して破壊してしまうとAIプログレスが一定値増加する。惑星を占領後に自分で処分した場合は問題ない。"
	},
	{
		"keywords":"惑星占領時に鹵獲",
		"eng":"Captured On Planet Ownership Change",
		"tips":"存在する惑星が占領されると、それに応じて所有権が移動する。"
	},
	{
		"keywords":"レーザー攻撃を自分に誘引",
		"eng":"Attracts All Incoming Lasers",
		"tips":"敵のLaser属性の弾を誘引し、別の味方艦を狙っていたものでも自分を狙うように強制する。"
	},
	{
		"keywords":"ワームホール使用不可",
		"eng":"Can't Use Wormholes",
		"tips":"ワームホールを通過できない。よってこの艦は他の惑星に移動することができない。"
	},
	{
		"keywords":"サプライ外の惑星に移動すると磨耗ダメージ",
		"eng":"Attrition Per Wormhole Hop Outside Supply xx%",
		"tips":"ワームホール通過時、移動先の惑星にサプライが供給されていないと耐久度を最大に対する割合で失う。<br>ダメージを受けるのは惑星移動が完了した瞬間。よって何かを格納していた場合は移動先の惑星で展開され、偵察も最後の移動先まで行われる。"
	},
	{
		"keywords":"即死効果",
		"eng":"Insta Kills <= Mark x",
		"tips":"表記されたランク以下の艦を一撃で破壊する。ランク表示のない艦はMark Iと見なされる。"
	},
	{
		"keywords":"クローク艦に即死効果",
		"eng":"Insta Kills Cloaked Ships",
		"tips":"クローク能力を持つ艦を一撃で破壊する。"
	},
	{
		"keywords":"建設開始時に消滅",
		"eng":"Consumed After Building One Ship",
		"tips":"この艦から何らかの建設を開始すると、その時点で自身は消滅する。"
	},
	{
		"keywords":"味方艦にクローク付加",
		"eng":"Cloaking SuperBooster",
		"tips":"周囲一定範囲内に居る味方艦にタキオンビームで看破されないクロークを付加する。攻撃した場合は普通通り探知される。<br>通常ならクローク機能を持たない艦でも対象となるが、移動不能な艦やクローク付加に耐性を持つ艦には無効。"
	},
	{
		"keywords":"上限付き迎撃",
		"eng":"Can Counter xx XX Simultaneously, Reloads xx Per Second",
		"tips":"周囲の味方艦に向けて発射された特定属性の攻撃に迎撃を放ち、着弾前に撃ち落とすように試みる。<br>迎撃には毎秒再装填されるチャージが必要で、敵弾の威力が1000以下なら1発で落とせるが、それ以上だと1000ごとに1発ずつ必要なチャージが増える。落としきるだけのチャージがない場合は迎撃不可能で、また複数の迎撃源が協力して1発を落とすこともできない。<br>迎撃の発生は敵弾の発射直後のみ判定。また距離によっては迎撃が当たる前に敵弾が目標に到達してしまう可能性もある。"
	},
	{
		"keywords":"鹵獲時にボーナスシップ解禁",
		"eng":"Unlocks Ship Type On Capture",
		"tips":"惑星が占領されて所有権が移動する際に、その惑星に関連付けられているボーナスシップを解禁する。解禁されたボーナスシップはこの艦が破壊されても失われない。<br>通常は占領と同時に自動的に1種が解禁されるが、事前にハッキングを仕掛けていた場合、研究能力のある艦によって3種のうち1つを選択できるようになる。事前に研究能力のある艦を惑星に派遣することによって候補を確認可能。"
	},
	{
		"keywords":"ワープゲート対応",
		"eng":"Can Spawn Ships At Intra-Galactic Warp Gate - XXXX",
		"tips":"対応するIntra-Galactic Warp Gateへと生産した艦を自動的にワープさせる。ワープに距離の制限はないが、移動した艦はゲートの種類に応じて一定時間麻痺する。<br>対応ゲートが複数ある場合、そのうちいずれかにランダム転送。Stand-downモードのゲートは対象としない。"
	},
	{
		"keywords":"敵艦のテレポート機能を無効化",
		"eng":"Prevents Enemy Teleportation",
		"tips":"惑星全域において、敵艦のテレポート機能を無効化する。"
	},
	{
		"keywords":"テレポート機能を無効化",
		"eng":"Prevents All Teleportation",
		"tips":"惑星全域において、敵味方問わずすべての艦のテレポート機能を無効化する。"
	},
	{
		"keywords":"レーザー攻撃を弱体化",
		"eng":"Reduces Power Of Nearby Incoming Lasers",
		"tips":"付近の味方艦へのレーザー攻撃の威力を25%低下させる。"
	},
	{
		"keywords":"巡航ミサイルを無害化",
		"eng":"Insta Kills Warheads",
		"tips":"主にMissile Siloより発射される巡航ミサイルを一撃で撃墜し、さらに破壊時に発生するはずの効果も無力化する。この場合、AIプログレスの増加も発生しない。"
	},
	{
		"keywords":"磨耗ダメージ",
		"eng":"Attritions Enemies xx/s",
		"tips":"惑星内の敵艦すべてに継続的にダメージを与える。"
	},
	{
		"keywords":"残骸回収",
		"eng":"Gradually Salvages xx% Metal From Units Destroyed Here",
		"tips":"惑星内で破壊されたAIの艦の残骸をゆっくりと回収、資源に変換する。<br>回収は漂っている残骸のうち毎秒0.6%。ただし1秒あたりの上限は100。<br>回収された残骸のうち、実際に資源になるのは能力で示された％分のみ。残りは単に消滅する。<br><br>残骸となるのは、人間側惑星で破壊されたAIの艦のみ。人間側の艦や、ゾンビ艦などは回収できない。また鹵獲された艦は残骸にならない。\n1惑星に同時に存在できる残骸の量は、惑星の所有者の資源貯蓄上限の2倍まで。"
	},
	{
		"keywords":"資源貯蔵",
		"eng":"Stores Up To xxxx Metal",
		"tips":"資源の貯蓄上限を拡張する。"
	},
	{
		"keywords":"破壊時に爆発",
		"eng":"xxxx Explosion Damage After Death (xxxx Range)",
		"tips":"破壊されると同時に爆発を起こし、周囲の敵ユニットにダメージを与える。<br>ダメージはまず1体に集中して与えられ、ダメージ上限に達する前に標的が破壊されると対象が移動する。<br>対象の優先順位は、ユニットに応じて低耐久度順か高耐久度順。"
	},
	{
		"keywords":"爆発ダメージ上限",
		"eng":"xxxx Max Explosion Damage Per Unit",
		"tips":"破壊時に発生する爆発で、1ユニットに対して与えられるダメージの上限。これ以上の耐久力を持つものには、破壊できないまま対象が次に移動する。"
	},
	{
		"keywords":"フォースフィールドのペナルティ軽減",
		"eng":"xx% Attack From Under Human Forcefield",
		"tips":"人間側のフォースフィールドに保護されている際の攻撃力低下が一定値に変更される。\n通常は攻撃力25%まで低下"
	}
]
}
